# Чтение и запись данных, часть 2

## Домашнее задание 

### Описание домашнего задания и формат сдачи

Выполните предложенные задачи — впишите свой код в ячейки после комментария `### YOUR CODE HERE ###` и сохраните изменения, используя опцию *Save and Checkpoint* из вкладки меню *File* или кнопку *Save and Checkpoint* на панели инструментов. Итоговый файл в формате `.ipynb` (файл Jupyter Notebook) загрузите в личный кабинет и отправьте на проверку.

In [1]:
import pandas as pd
import requests
import json
import sqlalchemy
import psycopg2
import pymongo
import csv

### Задача 1

Используя сервис MetaWeather узнайте, какая погода была в Лондоне 1 марта 2019 года. Для этого в первой ячейке определите идентификатор Лондона в этом сервисе, а во второй — запросите данные погоды. Обратите внимание, что сервис вернёт данные за несколько дней, а не только за 1 марта, в этой задаче это допустимо.

### Считываю погоду сейчас (21.01.2023) в Иваново, так как пользовался другим сервисом, см. подзадачи

In [23]:
#Запрос погоды сейчас
city_id = 555312
appid = "924d34e4fd642d5c55f44bc654d79277"

try:
    res = requests.get("http://api.openweathermap.org/data/2.5/weather",
                 params={'id': city_id, 'units': 'metric', 'lang': 'ru', 'APPID': appid})
    data = res.json()
    print("conditions:", data['weather'][0]['description'])
    print("temp:", data['main']['temp'])
    print("temp_min:", data['main']['temp_min'])
    print("temp_max:", data['main']['temp_max'])

except Exception as e:
    print("Exception (find):", e)
    pass

conditions: пасмурно
temp: -7.1
temp_min: -7.1
temp_max: -7.1

In [30]:
type(data['weather'])

list

### Задача 2
### Пропускаю задачу, так как пользовался другим сервисом, см. подзадачи

Сохраните данные погоды, полученные в предыдущей задаче, в файл `weather.json`. При сохранении используйте четыре пробела для форматирования.

In [31]:
with open('weather.json', 'w') as file:
    json.dump(data['weather'], file, indent=4)

### Задача 3

Загрузите содержимое файла `weather.json` в DataFrame и выведите первые пять строк DataFrame на экран.

In [32]:
df = pd.read_json('weather.json')
df.head()

    id    main description icon
0  804  Clouds    пасмурно  04n

### Задача 4

Сохраните DataFrame из предыдущей задачи в файл `result.csv`. В качестве названия столбца-индекса используйте `index`.

In [37]:
df = df.set_index('id')
df

       main description icon
id
804  Clouds    пасмурно  04n

### Задача 5

Загрузите содержимое SQL-таблицы `ratings` в DataFrame. Выведите первые пять строк DataFrame на экран. Для подключения к БД используйте строку подключения, указанную в следующей ячейке.

In [38]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()

['keywords',
 'links',
 'ratings',
 'exploratory',
 'new_table',
 'mobile',
 'course_purchases',
 'users',
 'joi',
 'superheroes',
 'product_types',
 'products',
 'orders',
 'sales',
 'studentt']

In [39]:
df = pd.read_sql("SELECT * FROM ratings", connect)
df.head()

   userid  movieid  rating   timestamp
0    5377   102445     3.5  1499055273
1    5377   103042     3.0  1499055273
2    5377   103228     4.0  1499055272
3    5377   103249     3.5  1499055045
4    5377   103253     3.0  1499055272

### Задача 6

Сохраните первые 10000 записей датафрейма из предыдущей задачи в файл `result2.xlsx`, при сохранении задайте листу имя `MySheet`.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр `sheet_name`)

In [40]:
df = pd.read_sql("SELECT * FROM ratings LIMIT 10000", connect)

df.to_excel("result2.xlsx")

In [41]:
# А вот сколько их всего. Поэтому задача 5 грузился некоторое времени

pd.read_sql("SELECT COUNT(*) FROM ratings", connect)

     count
0  1555552

### Задача 7

Определите количество документов в коллекции `users` в MongoDB. Если количество документов < 1000, то в следующей ячейке загрузите всё содержимое этой коллекции в список и выведите нулевой элемент этого списка на экран. Для подключения к MongoDB используйте строку подключения, указанную в следующей ячейке.

In [65]:
conn = 'mongodb://students:X63673t47Gl03Sq@dsstudents.skillbox.ru:27017/?authSource=movies'

client = pymongo.MongoClient(conn)
db = client['movies']

In [66]:
db.list_collection_names()

['tags', 'users']

In [71]:
users = db['users']
count = 0
for i in users.find():
    count += 1
count

# Функция "users.find().count()" не работает, раз надо решить, то пускай будет хоть так.

100

In [72]:
users = db['users']

users_list = list()

for doc in users.find():
    users_list.append(doc)
users_list[0]

{'_id': ObjectId('5cc69095067496679c74f7a4'),
 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892',
 'first_name': 'Жанна',
 'last_name': 'Петрова',
 'mail': 'zhanna_03816@gmail.com',
 'age': 20.0}

### Задача 8

Преобразуйте список всех документов коллекции `users` из предыдущей задачи в pandas DataFrame и сохраните его содержимое в файл `result3.xlsx`.

In [73]:
df = pd.DataFrame(users_list)
df.head()

,_id,user_id,first_name,last_name,mail,age
0,5cc69095067496679c74f7a4,ed5da480-57a2-489c-8e68-512155ab9892,Жанна,Петрова,zhanna_03816@gmail.com,20.0
1,5cc690e2067496679c74f7a5,7ba07e70-f76a-4bbc-9b5d-34265f4f7638,Андрей,Белоусов,andrej_23624@ivi.ru,18.0
2,5cc690e2067496679c74f7a6,8b1752da-599d-413a-a2e9-bc75387b2be9,Евгения,Дементьева,evgenija_22008@skillbox.ru,18.0
3,5cc690e2067496679c74f7a7,3e3b7b84-65f0-4152-815a-730bec31bb9d,Василиса,Семенова,vasilisa_42757@ivi.ru,18.0
4,5cc690e2067496679c74f7a8,8c390b6e-a490-44ac-b974-f5dec7f6970b,Наина,Горбунова,naina_95710@ivi.ru,19.0

In [74]:
df.to_excel("result3.xlsx")

## Дополнительные (необязательные) задачи

### Задача 9

Используя данные SQL-таблицы `ratings`, для каждого пользователя (столбец `userid`) определите средний рейтинг, который этот пользователь поставил фильмам. Результат выведите на экран. 

Группировку проведите двумя способами: с помощью `GROUP BY` в строке запроса к БД и с использованием метода `groupby` в pandas.

Для подключения к БД используйте строку подключения в следующей ячейке

In [75]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()

['keywords',
 'links',
 'ratings',
 'exploratory',
 'new_table',
 'mobile',
 'course_purchases',
 'users',
 'joi',
 'superheroes',
 'product_types',
 'products',
 'orders',
 'sales',
 'studentt']

In [80]:
df_1 = pd.read_sql("SELECT userid, AVG(rating) AS avg_ratings FROM ratings GROUP BY userid", connect)
df_1

      userid  avg_ratings
0       6114     4.000000
1       4790     4.000000
2        273     4.314685
3       3936     3.756757
4       5761     3.419220
...      ...          ...
7951    4827     2.828025
7952    7227     3.950000
7953     790     3.918605
7954    2850     3.468750
7955    5642     4.026786

[7956 rows x 2 columns]

In [81]:
df_2 = pd.read_sql("SELECT userid, rating FROM ratings", connect)

In [82]:
df_2.head()

   userid  rating
0    5455     3.5
1    5455     4.0
2    5455     2.5
3    5455     3.0
4    5455     3.5

In [84]:
df_3 = df_2.groupby("userid").mean()
df_3

          rating
userid
1       4.277778
2       3.318182
3       3.100000
4       3.500000
5       4.269231
...          ...
7952    3.390244
7953    3.567568
7954    3.750000
7955    4.150000
7956    3.290640

[7956 rows x 1 columns]

### Задача 10

Объедините таблицы `ratings` и `keywords` по столбцам `movieid` (используйте левое объединение). Объединение проведите двумя способами: с помощью `LEFT JOIN` в строке запроса к БД и с использованием метода `merge` в pandas. Результат объединения загрузите в DataFrame и сохраните в файл `result4.csv`.

Обратите внимание, что при объединении возможно дублирование столбцов. В результирующем датафрейме не должно быть таких дублированных столбцов.

In [2]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

In [5]:
pd.read_sql("SELECT * FROM keywords LIMIT 1 ", conn)

   movieid                                               tags
0      862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...

In [6]:
pd.read_sql("SELECT * FROM ratings LIMIT 1 ", conn)

   userid  movieid  rating   timestamp
0    5455     3174     3.5  1254440873

In [7]:
df_10 = pd.read_sql("SELECT userid, ratings.movieid, rating, timestamp, tags FROM ratings LEFT JOIN keywords ON keywords.movieid = ratings.movieid", conn)
df_10

,userid,movieid,rating,timestamp,tags
0,5455,3174,3.5,1254440873,None
1,5455,6367,2.5,1254448161,None
2,5455,6887,3.5,1254449044,None
3,5456,315,3.0,1085110985,"[{'id': 627, 'name': 'killing'}, {'id': 999, '..."
4,5456,315,3.0,1085110985,"[{'id': 627, 'name': 'killing'}, {'id': 999, '..."
...,...,...,...,...,...
2236573,5454,1244,4.5,1209967092,"[{'id': 460, 'name': 'free love'}, {'id': 738,..."
2236574,5454,1244,4.5,1209967092,"[{'id': 460, 'name': 'free love'}, {'id': 738,..."
2236575,5454,1962,3.5,1209967089,None
2236576,5454,2288,2.0,1209967232,"[{'id': 494, 'name': 'father son relationship'..."
2236577,5454,2288,2.0,1209967232,"[{'id': 494, 'name': 'father son relationship'..."

In [16]:
## сохранение в csv на будущую работу
df_10.to_csv('result4.csv')

In [ ]:
### Второе решение

In [3]:
df_11 = pd.read_sql("SELECT * FROM keywords", conn)

In [4]:
df_12 = pd.read_sql("SELECT * FROM ratings", conn)

In [5]:
cols_to_use = df_12.columns.difference(df_11.columns)

In [9]:
df_20 = pd.merge(df_12, df_11, left_on='movieid', right_on='movieid', how='left')

In [10]:
df_20

         userid  movieid  rating   timestamp tags
0          5455     3174     3.5  1254440873  NaN
1          5455     5796     4.0  1254449063  NaN
2          5455     6367     2.5  1254448161  NaN
3          5455     6765     3.0  1254448210  NaN
4          5455     6887     3.5  1254449044  NaN
...         ...      ...     ...         ...  ...
2236573    5455     2083     3.5  1254448037  NaN
2236574    5455     2389     4.0  1254448062  NaN
2236575    5455     2615     2.5  1254448235  NaN
2236576    5455     3020     4.5  1254440900  NaN
2236577    5455     3105     4.5  1254440893  NaN

[2236578 rows x 5 columns]

### Задача 11

Используя объединенную таблицу из предыдущего задания, найдите все идентификаторы фильмов с тегом `africa` (но не `south africa` или любые другие). Список тегов в формате JSON записан в столбце `tags`.

In [ ]:
## раздел для исследования

In [33]:
df_20['tags'][9]

"[{'id': 30, 'name': 'individual'}, {'id': 246, 'name': 'dancing'}, {'id': 279, 'name': 'usa'}, {'id': 642, 'name': 'robbery'}, {'id': 730, 'name': 'factory worker'}, {'id': 1328, 'name': 'secret'}, {'id': 1382, 'name': 'factory'}, {'id': 1415, 'name': 'small town'}, {'id': 1691, 'name': 'dance'}, {'id': 1741, 'name': 'blindness and impaired vision'}, {'id': 2122, 'name': 'death penalty'}, {'id': 2356, 'name': 'immigrant'}, {'id': 2480, 'name': 'eye operation'}, {'id': 2481, 'name': 'eyesight'}, {'id': 2486, 'name': 'fantasy'}, {'id': 2487, 'name': 'naivety'}, {'id': 2488, 'name': 'self-abandonment'}, {'id': 2489, 'name': 'hereditary disease'}, {'id': 2490, 'name': 'loss of eyesight'}, {'id': 2624, 'name': 'czech'}, {'id': 3737, 'name': 'dying and death'}, {'id': 4580, 'name': 'van'}, {'id': 6054, 'name': 'friendship'}, {'id': 9826, 'name': 'murder'}, {'id': 10508, 'name': 'teacher'}, {'id': 11061, 'name': 'debt'}, {'id': 13129, 'name': 'execution'}, {'id': 14536, 'name': 'crime'}, {'id': 15090, 'name': 'police officer'}]"

In [23]:
type(df_20['tags'][9])

str

In [31]:
df_20['tags'][9]

'{'

In [39]:
## ищем подстроку
text = df_20['tags'][9]
if text.find("name': 'factory worker") != -1:
    print('True')

True

In [ ]:
###### Решение ######

In [55]:
movieid = df_20['movieid']
tags = df_20['tags']

In [56]:
print(type(movieid))
print(type(tags))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [72]:
afric_movies = list()
for movie, tag in zip(movieid, tags):
    if (isinstance(tag, str)) and (tag.find("'africa'") != -1):
        afric_movies.append(movie)

afric_movies

[494,
 494,
 494,
 494,
 2989,
 2989,
 4274,
 4274,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 179,
 179,
 494,
 494,
 1672,
 1672,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 4460,
 4460,
 8929,
 8929,
 1672,
 1672,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 25874,
 25874,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 2989,
 2989,
 1672,
 1672,
 4274,
 4274,
 494,
 494,
 494,
 494,
 2989,
 2989,
 4274,
 4274,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 179,
 179,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 4274,
 4274,
 494,
 494,
 179,
 179,
 494,
 494,
 1672,
 1672,
 494,
 494,
 2197,
 2197,
 494,
 494,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 494,
 494,
 488,
 488,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 494,
 494,
 179,
 179,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 179,
 179,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 2197,
 2197,
 488,
 488,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 494,
 494,
 494,
 494,
 488,
 488,
 1672,
 1672,
 38198,
 38198,
 494,
 494,
 494,
 494,
 1672,
 1672,
 179,
 179,
 494,
 494,
 1672,
 1672,
 488,
 488,
 2989,
 2989,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 2197,
 2197,
 2989,
 2989,
 4274,
 4274,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 4274,
 4274,
 494,
 494,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 494,
 494,
 179,
 179,
 488,
 488,
 1672,
 1672,
 2197,
 2197,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 488,
 488,
 179,
 179,
 179,
 179,
 1672,
 1672,
 488,
 488,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 38198,
 38198,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 179,
 179,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 1672,
 1672,
 494,
 494,
 494,
 494,
 179,
 179,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 4460,
 4460,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 488,
 488,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 1672,
 1672,
 494,
 494,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 2989,
 2989,
 7010,
 7010,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 2197,
 2197,
 1672,
 1672,
 2989,
 2989,
 179,
 179,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 179,
 179,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 1672,
 1672,
 494,
 494,
 494,
 494,
 1672,
 1672,
 4274,
 4274,
 494,
 494,
 2197,
 2197,
 2989,
 2989,
 1672,
 1672,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 2197,
 2197,
 2989,
 2989,
 179,
 179,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2197,
 2197,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 179,
 179,
 494,
 494,
 179,
 179,
 494,
 494,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 38198,
 38198,
 1672,
 1672,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 488,
 488,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 494,
 494,
 494,
 494,
 1672,
 1672,
 1672,
 1672,
 1672,
 1672,
 1672,
 1672,
 494,
 494,
 2989,
 2989,
 4274,
 4274,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 2989,
 2989,
 7010,
 7010,
 494,
 494,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 2989,
 2989,
 494,
 494,
 7010,
 7010,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 1672,
 1672,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 494,
 494,
 4274,
 4274,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 38198,
 38198,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 494,
 494,
 1672,
 1672,
 494,
 494,
 2989,
 2989,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 179,
 179,
 494,
 494,
 494,
 494,
 2989,
 2989,
 1672,
 1672,
 2989,
 2989,
 494,
 494,
 494,
 494,
 179,
 179,
 494,
 494,
 179,
 179,
 488,
 488,
 494,
 494,
 25874,
 25874,
 494,
 494,
 2989,
 2989,
 494,
 494,
 494,
 494,
 1672,
 1672,
 494,
 494,
 2989,
 2989,
 38198,
 38198,
 1672,
 1672,
 1672,
 1672,
 494,
 494,
 494,
 494,
 494,
 494,
 2989,
 2989,
 494,
 494,
 1672,
 1672,
 7010,
 7010,
 ...]